filmlogs_server/app/controllers/photos_controller.rb

  def index
    @allPhoto = Photo.all
---
SELECT "photos".* FROM "photos"

  def create
    newPhoto = Photo.create!(photo_params)
---
INSERT INTO "photos" ("image", "slideshow_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", nil], ["slideshow_id", 5], ["created_at", "2022-09-24 04:20:12.815044"], ["updated_at", "2022-09-24 04:20:12.815044"]]

  def find_photo
    @photo = Photo.find_by(id: params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]