filmlogs_server/app/controllers/slideshows_controller.rb

  def index
    render json: Slideshow.all, status: :ok
---
SELECT "slideshows".* FROM "slideshows"

  def create
    slideshow = Slideshow.create!(slideshow_params)
---
INSERT INTO "slideshows" ("city", "country", "date", "note", "isReleased", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @slideshow.update!(slideshow_params)
---
UPDATE "slideshows" SET "isReleased" = ?, "updated_at" = ? WHERE "slideshows"."id" = ?  [["isReleased", 1], ["updated_at", "2022-09-26 00:46:39.933808"], ["id", 4]]

  def find_slideshow
    @slideshow = Slideshow.find_by(id: params[:id])
---
SELECT "slideshows".* FROM "slideshows" WHERE "slideshows"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]